app/controllers/products_controller.rb

SELECT "products".* FROM "products" ORDER BY "products"."id" ASC LIMIT $1  [["LIMIT", 1]]
SELECT "variants"."size" FROM "variants" WHERE "variants"."product_id" = $1  [["product_id", 1]]
SELECT "variants"."color" FROM "variants" WHERE "variants"."product_id" = $1  [["product_id", 1]]
---
  def show
    @product = Product.first  # Since we only have one product
    @variants = {
      "red" => { "small" => { stock: 5 }, "medium" => { stock: 3 } },
      "blue" => { "small" => { stock: 0 }, "medium" => { stock: 2 } }
    }
    @sizes = @product.variants.pluck(:size).uniq  # Get unique sizes
    @colors = @product.variants.pluck(:color).uniq  # Get unique colors